run/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//0.1 per cell
vertices
(
    (-1.5 -1.5 0)
    ( 3.0 -1.5 0)
    ( 3.0  1.5 0)
    (-1.5  1.5 0)
    (-1.5 -1.5 0.2)
    ( 3.0 -1.5 0.2)
    ( 3.0  1.5 0.2)
    (-1.5  1.5 0.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (45 30 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    TOP
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    BOTTOM
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    INLET
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    OUTLET
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    SYMMETRY
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }

    WALL
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
